title: Ingress Tool Transfer via BITSAdmin
id: a1921cd3-t1105-bitsadmin-download
status: experimental
description: Detects file download activity using bitsadmin.exe, commonly abused by attackers to transfer tools or payloads from remote servers
references:
    - https://attack.mitre.org/techniques/T1105
    - https://github.com/redcanaryco/atomic-red-team
author: Ghofrane Amemi
date: 2026-02-01
tags:
  - attack.command_and_control
  - attack.t1105
  - atomic_red_team

logsource:
  product: windows
  category: process_creation
  service: sysmon

detection:
  selection_bitsadmin:
    Image|endswith: '\bitsadmin.exe'
    CommandLine|contains:
      - '/transfer'
      - 'https'

  condition: selection_bitsadmin

falsepositives:
  - Legitimate system administration
  - Software update mechanisms
  - Internal IT automation using BITS

level: high
